Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Textual Conventions .......................................21 6.3.
ja: テキスト表記法 .......................................21 6.3.

source: It is RECOMMENDED that the reply to these messages be requested and checked.
ja: これらのメッセージに対する返答は要求され検査されることが推奨される.

source: Providing OCSP responses directly in this data structure can reduce the number of communication rounds required (saving the implementation from needing to perform OCSP checking out-of-band) and can also allow a client outside of a private network to receive OCSP responses from a server behind a firewall.
ja: このデータ構造の中で直接 OCSP 応答を提供することで, 必要な通信のラウンド数を減らすことができ (帯域外の OCSP 検査を実行する必要が実装でなくなる) ファイアウォールの背後のサーバから プライベートなネットワークの外側のクライアントが OCSP 応答を受けとれるようになる.

source: It is also possible to use a different password-validation protocol such as the Challenge Handshake Authentication Protocol (CHAP) [RFC1994] or digest authentication [RFC5090] to integrate with RADIUS or Diameter.
ja: RADIUS や Diameter と統合するためにチャレンジハンドシェイク認証プロトコル (CHAP) [RFC1994] や ダイジェスト認証 [RFC5090] のような別のパスワード検証プロトコルを利用することも可能だ.

source: This memo describes how SNMP can be used within a Secure Shell (SSH) session, using the SSH connection protocol [RFC4254] over the SSH transport protocol, and using ssh-userauth [RFC4252] for authentication.
ja: このメモは, SSH トランスポートプロトコル上のSSHコネクションプロトコル [RFC4254] を用いて, また, 認証に ssh-userauth [RFC4252] を用いて, セキュアシェル (SSH) のセッション中でどのように SNMP を利用するかを記述する.

source: The previous version of this document defined the character sequence "]]>]]>" as a message separator, under the assumption that it could not be found in well-formed XML documents.
ja: この文書の以前のバージョンは, メッセージの分割子として文字列 "]]>]]>" を用いていた. これは整形された XML 文書では出てこないという仮定に基づいていた.

source: As stated earlier, the 'protoversion' specified for this protocol is "2.0".
ja: 前述したように, このプロトコルのために定義された 'protoversion' は "2.0" だ.

source: ECMQV Message Numbers .....................................13 8.
ja: ECMQV メッセージ番号 .....................................13 8.

source: Unlike USM, cryptographic keys will be different on both sides of the SSH connection.
ja: USM と違い, SSH の接続の両側で暗号鍵が異なる.

source: A key file is a text file, containing a sequence of lines.
ja: 鍵ファイルは行の並びを含むテキストファイルだ.

source: (See Section 3.4.)
ja: (3.4 節を参照.)

source: solve the ECDLP in polynomial time, but at present large-scale quantum computers have not been constructed and significant experimental physics and engineering work needs to be done before large-scale quantum computers can be constructed.
ja: (量子計算機での Shorのアルゴリズムは多項式時間で ECDLP を解ける. しかし, 現在大規模な量子計算機は構築されておらず, その構築には, 非常の実験的な物理やエンジニアリングの作業がなされなければならない.

source: Systems supporting non-ASCII passwords SHOULD always normalize passwords and user names whenever they are added to the database, or compared (with or without hashing) to existing entries in the database.
ja: ASCII以外のパスワードをサポートするシステムは, パスワードとユーザ名をデータベースに追加したり(ハッシュしたり,もしくはせずに)データベース内のエントリと比較する際にいつでも正規化する必要がある.

source: The Secure Shell Protocol (SSH) is a protocol for secure remote login and other secure network services over an insecure network.
ja: セキュア シェル (SSH) プロトコルは, 安全ではないネットワーク上での安全なリモートログインや他の安全なネットワークサービスのためのプロトコルだ.

source: Conventions Used in this Document
ja: この文書で用いる表記

source: DESCRIPTION "The number of times an openSession() request failed to open a transport connection or failed to authenticate the server.
ja: DESCRIPTION "トランスポート接続の開始に失敗した ないし サーバの認証に失敗した openSession() 要求の回数

source: Only one of these requests can succeed per channel.
ja: これらの要求のうち, チャンネルごとに1つだけが成功する.

source: snmpSshtmSessionUserAuthFailures OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "The number of times an openSession() request failed to open a session as an SSH client due to user-authentication failures.
ja: snmpSshtmSessionUserAuthFailures OBJECT-TYPE SYNTAX Counter32 MAX-ACCESS read-only STATUS current DESCRIPTION "ユーザ認証の失敗のため SSH クライアントとしてセッションの開始に失敗した openSession() 要求の回数.

source: Although not padding messages can reduce the protocol's network consumption, this document requires that padding be a multiple of the block cipher's block length in order to (1) not alter
ja: パディングしないメッセージがプロトコルのネットワークの消費を抑えうるにもかかわらず, この文書はブロック暗号のブロック長の倍数のパディングを要求する.

source: IANA has allocated the RR type code 44 for SSHFP from the standard RR type space.
ja: IANA は, 標準 RR タイプ空間から SSHFP に RR タイプコード 44 を割り当てた.

source: Family 1 or Family 2 (min_LOS 128): kex_algorithm name_list := { ecdh_sha2_nistp256, ecdh_sha2_nistp384 } encryption_algorithm name_list := { AEAD_AES_128_GCM, AEAD_AES_256_GCM } mac_algorithm name_list := { AEAD_AES_128_GCM, AEAD_AES_256_GCM }
ja: ファミリー 1 もしくはファミリー 2 (min_LOS 128): kex_algorithm name_list := { ecdh_sha2_nistp256, ecdh_sha2_nistp384 } encryption_algorithm name_list := { AEAD_AES_128_GCM, AEAD_AES_256_GCM } mac_algorithm name_list := { AEAD_AES_128_GCM, AEAD_AES_256_GCM }

source: o in the SSH_MSG_KEXGSS_HOSTKEY message [RFC4462]
ja: o SSH_MSG_KEXGSS_HOSTKEY メッセージ内 [RFC4462]

source: The runtime of general attacks depends on the algorithm used.
ja: 一般的な攻撃のランタイムは, 利用されるアルゴリズムに依存する.

source: The relative merits of these and other ciphers may also be found in current literature.
ja: 暗号ごとの相対的なメリットについては最近の文献に記述されている.

source: Overview and Rationale
ja: 概要と原理

source: However, it MAY be sent by the client.
ja: しかし, これはクライアント側から送られてもよい.

source: o If the client's reference identifier (e.g., the host name typed by the client) is a DNS domain name, the server's identity SHOULD be checked using the rules specified in [RFC6125].
ja: o クライアントの参照識別子(例えば, クライアントで入力されたホスト名) が DNS ドメイン名なら, サーバの ID は [RFC6125] に指定されているルールを用いて検査される必要がある.

source: The mechanism OID must be one of the OIDs sent by the client in the SSH_MSG_USERAUTH_REQUEST packet.
ja: メカニズムの OID は， SSH_MSG_USERAUTH_REQUEST パケットでクライアントから送られた OIDの1つでなければならない．

source: The manager issues NETCONF remote procedure call (RPC) commands, and the agent replies to those commands.
ja: マネージャは, NETCONF リモートプロシージャコール (RPC) コマンドを発行し, エージェントはそれらのコマンドに応答する.

source: The format of the SSH_MSG_KEXECDH_REPLY is:
ja: SSH_MSG_KEXECDH_REPLY の形式は以下だ:

source: Different types of terminal emulation may also be employed in the client, and the character set to be used is effectively determined by the terminal emulation.
ja: 異なる端末エミュレーションのタイプがクライアントで用いられることがある. また, 端末エミュレーションによって利用される文字セットが事実上決定される.

source: The encoding of the ECDSA signature Sig_U as an octet string is as described in Section 3.1.2 of [SSH-ECC].
ja: ECDSA 署名 Sib_U のオクテット文字列としてのエンコーディングは, [SSH-ECC] の 3.1.2 節で記述されている.

source: Minimum Levels of Security (minLOS) ........................4 2.2.
ja: セキュリティ最小レベル (minLOS) ........................4 2.2.

source: Introduction .
ja: 導入 .

source: Appendix A. On the Size of K
ja: 付録 A. K のサイズ

source: Essentially, it is for experimentation.
ja: 基本的に, この範囲は実験のためにある.

source: Only the session_id will remain unchanged.
ja: session_id のみは変更されない.

source: Messages sent by the client are marked with "C:", and messages sent by the server are marked with "S:".
ja: クライアントから送られるメッセージには "C:" を, サーバから送られるメッセージには "S:" を付けている.

source: If the client has been compromised, and the server fails to stop the attacker at the authentication protocol, all services exposed (either as subsystems or through forwarding) will be vulnerable to attack.
ja: クライアントが侵害されていると, 認証プロトコルでサーバが攻撃者を防止することができず, (サブシステムによるものや転送されるものも含む)公開されているすべてのサービスが攻撃に脆弱となる.

source: Note that in the method described in this document, message number 62 is unused.
ja: 注意: この文書で記述された方法では, メッセージ番号 62 は未使用だ.

source: S sends "K_S || f || s" to C. The signing operation may involve a second hashing operation.
ja: S は "K_S || f || s" を C に送る. 署名の操作は2つめのハッシュ操作を伴なうかもしれない.

source: Appendix A: Generation of Safe Primes
ja: Appendix A：安全な素数の生成

source: Requesting X11 Forwarding
ja: X11 転送の要求

source: Information regarding estimated equivalence of key sizes is available in [NIST-800-57]; the discussion in [RFC3766] is also relevant.
ja: 鍵サイズの同等性の見積りについての情報は, [NIST-800-57] にある. [RFC3766]の議論も関連している.

source: The SSH Transport Protocol is specified in the transport document [RFC4253].
ja: SSHトランスポートプロトコルは, トランスポート文書 [RFC4253] で定義されている.

source: See Section 9 of [SSH-Tran].
ja: [SSH-Tran] の 9節を参照.

source: Strings are allowed to contain arbitrary binary data, including null characters and 8-bit characters.
ja: stringは, nullや8-bitの文字も含む, 任意のバイナリデータを保持できる.

source: The primary use of this feature is to allow TCP- wrappers to display an error message before disconnecting.
ja: この特徴の主要な目的は, TCP-wrappers に切断の前にエラーメッセージを表示することを許すことだ.

source: Thus, the credentials presented by a notification receiver MUST match the expected value(s) for a given transport address, and ownership of the credentials MUST be properly cryptographically verified.
ja: このため, 通知の受信者から提示された視覚情報は, 与えられたトランスポートアドレスに対して予測される値と一致しなければならない. また, 資格情報の所有権は, 暗号学的に適切に検証されなければならない.

source: This document does not suggest increasing the length of the sequence number because doing so could hinder interoperability with older versions of the SSH protocol.
ja: この文書では, シーケンス番号の長さを増やすことを示唆しない. こうすると, 古いバージョンのSSHプロトコルとの相互運用性を妨げるかもしれないからだ.

source: In this scenario, the implementation SHOULD verify the host key against a local database before verifying the key via the fingerprint returned from DNS.
ja: このシナリオでは, DNSから返される指紋による鍵の検証の前にローカルなデータベースに対するホスト鍵の検証を実装する必要がある.

source: If a party to the SSH exchange attempts to use a revoked X.509v3 certificate, this attempt along with the date, time, certificate identity, and apparent origin IP address of the attempt SHOULD be logged as a security event in the system's audit logs or the system's general event logs.
ja: 失効された X.509v3 証明書を用いて SSH の交換を試行する者がいたら, システムの監査ログかシステムの一般イベントログにセキュリティイベントとしてその試行に関連する日時, 証明書のid, みかけの試行元 IPアドレスが記録される必要がある.

source: The underlying transport SHOULD protect against transmission errors, as such errors cause the SSH connection to terminate.
ja: 下層にあるトランスポートは, 転送エラーに対する保護をする必要がある. そのようなエラーはSSHのコネクションを終了させる原因となる.

source: Related to this, Waldvogel and Massey note: When private exponents are chosen independently and uniformly at random from {0,...,p-2}, the key entropy is less than 2 bits away from the maximum, lg(p-1) [WALDVOGEL].
ja: これに関連して, Waldvogel と Massey は主張している : プライベート指数が{0,...,p-2}で独立に一様にランダムに選択されるなら, 鍵のエントロピーは最大値である lg(p-1)から2bit未満しか小さくならない [WALDVOGEL].

source: Since SSH performs its own negotiation of authentication and key exchange methods, the negotiation capability of SPNEGO alone does not provide any added benefit.
ja: SSHは自身で認証法や鍵交換法の交渉をするので, SPENGO 単独での交渉能力は利益をもたらさない.

source: The SSH_MSG_KEXINIT name lists can be used to constrain the choice of non-signature and host key algorithms in accordance with the guidance given in Section 2.
ja: SSH_MSG_KEXINIT の name-list は, 2節で与えガイダンスに従って, 署名以外のアルゴリズムとホスト鍵アルゴリズムの選択を制限するのに利用できる.

source: The two elliptic curves used in Suite B appear in the literature under two different names.
ja: Suite B で利用される2つの楕円曲線は, それぞれ異なる2つの名前で文献に登場する.

source: The maximum amount of data allowed is determined by the maximum packet size for the channel, and the current window size, whichever is smaller.
ja: 許されるデータの最大量は, チャンネルの最大 packet size と現在の window size の小さいほうで決定される.

source: Fingerprint Type Specification
ja: 指紋のタイプの仕様

source: * It is RECOMMENDED that the client verify that the host key sent is the server's host key (for example, using a local database).
ja: * クライアントが(例えばローカルなデータベースを用いて)送られたホスト鍵がサーバのホスト鍵かどうか検証するのを推奨する.

source: 13 VWERASE Erases a word left of cursor.
ja: 13 VWERASE カーソルの左の word を消す.

source: Therefore, when a new key for an already-known host is received via the SSH_MSG_KEXGSS_HOSTKEY message, clients SHOULD NOT issue strong warnings or abort the connection, provided the GSS-API-based key exchange succeeds.
ja: このため, SSH_MSG_KEXGSS_HOSTKEY メッセージで既知のホストから新しい鍵を受け取っても, GSS-APIベースの鍵交換が成功するならば, クライアントは強い警告の発行や接続の中断をしないほうがよい.

source: Failures in either node, death of the deamon serving the communication, routing problems in the network between, firewalls that block the traffic, and other problems can prevent the SSH Transport Model from working.
ja: どちらのノードでの失敗や, 接続を提供するデーモンの死, ネットワーク間のルーティング問題, トラフィックをブロックするファイアウォール, またその他の問題は, SSH トランスポートモデルが正常に動作するのを妨げる.

source: Any normalization or other preparation of names is done by the ssh server based on the requirements of the system, and is outside the scope of SSH.
ja: システムの要求に基づいてサーバによって行なわれる 名前の正規化や処理は SSHの範囲外だ

source: The extended data type SSH_EXTENDED_DATA_STDERR has been defined for stderr data.
ja: 拡張データタイプ SSH_EXTENDED_DATA_STDERR が標準エラー出力のために定義されている.

source: The Secure Shell (SSH) Transport Layer Encryption Modes
ja: セキュア シェル (SSH) トランスポート層暗号モード

source: The second alternative eases the maintenance problem, since ideally only a single CA key needs to be securely stored on the client.
ja: この2番目のやり方は, 管理の問題を軽減する. 理想的には単一のCAの鍵だけをクライアントで安全に保管するだけでよいからだ.

source: 62 PENDIN Retype pending input.
ja: 62 PENDIN 中断した入力を再入力する.

source: Note that implementations MUST use the string identifiers for the three REQUIRED NIST curves, even when an OID exists for that curve.
ja: 実装は, 3つの必須のNISTの曲線については, これらの曲線のOIDがあったとしても, 文字列の識別子を用いなければならないことに注意.

source: The tmSecurityName is presented to the SSH Transport Model by the application (possibly because of configuration specified in the SNMP-TARGET-MIB).
ja: tmSecurityName は アプリケーションによって SSH トランスポートモデルに示される (おそらく SNMP-TARGET-MIB で指定される設定より).

source: The server decrypts K. If a decryption error occurs, the server SHOULD send SSH_MESSAGE_DISCONNECT with a reason code of SSH_DISCONNECT_KEY_EXCHANGE_FAILED and MUST disconnect.
ja: サーバは K を復号する. 復号エラーが起きたら, サーバは reason code が SSH_DISCONNECT_KEY_EXCHANGE_FAILED の SSH_MESSAGE_DISCONNECT を送る必要があり, 接続を切断しなければならない.

source: Message numbers of 80 and higher are reserved for protocols running after this authentication protocol, so receiving one of them before authentication is complete is an error, to which the server MUST respond by disconnecting, preferably with a proper disconnect message sent to ease troubleshooting.
ja: 80以上のメッセージ番号は, 認証プロトコルのあとで動作するプロトコルのために予約されている. 認証が完了する前にこの範囲の番号を受けとったらそれはエラーだ. サーバは, 切断を返答しなければならない. トラブルシューティングを容易にするために適切な切断メッセージをM送ることが好ましい.

source: If the server intends to respond with a failure message, it MAY delay for an implementation-dependent time before sending it to the client.
ja: サーバが失敗メッセージで応答しようとする場合, クライアントに送信する前に実装依存の時間送らせてもよい.

source: The following table lists the initial assignments of the Signal Names.
ja: 次の表で, シグナル名の初期の割り当てを示す.

source: If this message is sent, the server public host key(s) and/or certificate(s) in this message are encoded as a single string, in the format specified by the public key type in use (see [SSH-TRANSPORT], Section 6.6).
ja: このメッセージが送られる場合, このメッセージ中のサーバホスト鍵 と/もしくは 証明書は, 利用している公開鍵タイプで指定されたフォーマットで単一の文字列としてエンコードされる([SSH-TRANSPORT]の6.6節を参照)

source: Password Authentication
ja: パスワード認証

source: The use of smartcards, or other technology to make passphrases an enforceable policy is suggested.
ja: パスフレーズを強制可能なポリシーにできるスマートカードや他の技術の利用が示唆される.

source: The modulus of K_T MUST be at least MINKLEN bits long.
ja: K_T のモジュラスは, 少なくとも MINKLEN ビットの長さでなければならない.

source: This document addresses the requirement to utilize client- authentication and key-exchange methods that support different security infrastructures and provide different security properties.
ja: この文書は, 異なるセキュリティ基盤をサポートし異なるセキュリティの特性を提供するクライアント認証と鍵交換法の利用の要件を説明する.

source: The first algorithm MUST be the preferred (and guessed) algorithm.
ja: 最初のアルゴリズムが, 優先する(そして推測する)アルゴリズムでなければならない.

source: The 'signal name' is one of the following (these are from [POSIX]).
ja: 'signal name' は次のうちの1つだ (これらは [POSIX] による).

source: To prevent confinement attacks, they MUST accept the shared secret K only if 1 < K < p - 1.
ja: 限定攻撃(confinement attack) を防ぐため, 共有の秘密 K は 1 < K < p-1 のものだけ受け入れなければならない.

source: It may be necessary to provide additional implementation-specific configuration of SSH parameters.
ja: 追加の設定として, SSHのパラメータの実装特有の設定の提供が必要となるだろう.

source: Some issues are related to security; for example, the policy SHOULD NOT allow the server to start sessions or run commands on the client machine, and MUST NOT allow connections to the authentication agent unless forwarding such connections has been requested.
ja: いくつかの問題はセキュリティに関連している; 例えば,クライアントのマシン上でサーバがセッションを開始したりコマンドを実行したりするのをポリシーは許可しないほうがよいし, 転送が要求されていないのに認証エージェントへの接続をポリシーが許可してはならない.

source: This document describes the SSH transport layer protocol, which typically runs on top of TCP/IP.
ja: この文書は, SSH トランスポート層プロトコルについて記述する. このプロトコルは, 通常は TCP/IP 上で動作する.

source: An example is requesting a pty (pseudo terminal) for an interactive session.
ja: 例に, インタラクティブなセッションでの pty (擬似ターミナル)の要求がある.

source: Minimum Levels of Security (minLOS)
ja: セキュリティ最小レベル (minLOS)

source: It uses much less client CPU time than the Diffie-Hellman algorithm specified as part of the core protocol, and hence is particularly suitable for slow client systems.
ja: コアプロトコルの一部として指定されている Diffie-Hellman アルゴリズムよりもクライアントのCPU時間の消費がかなり小さいので, 遅いクライアントのシステムに特に適している.

source: When a public key from this specification is included in the input to a hash algorithm, the exact bytes that are transmitted on the wire must be used as input to the hash functions.
ja: この仕様の公開鍵がハッシュアルゴリズムの入力に含まれる場合, 通信で転送された正確なバイト列をハッシュ関数の入力として用いなければならない.

source: If the transport layer does not provide confidentiality, authentication methods that rely on secret data SHOULD be disabled.
ja: トランスポート層が機密性を提供していない場合は, 秘密のデータに依存する認証法は無効にされる必要がある.

source: This message can be used as an additional protection measure against advanced traffic analysis techniques.
ja: このメッセージは, 高度なトラフィック解析技術に対する追加の保護手段のために用いられる.

source: This algorithm is defined in [FIPS-46-3].
ja: このアルゴリズムは, [FIPS-46-3] で定義されている.

source: This section defines a class of key exchange methods that combine the Diffie-Hellman key exchange from Section 8 of [SSH-TRANSPORT] with mutual authentication using GSS-API.
ja: この節では, [SSH-TRANSPORT]の8節の Diffie-Hellman 鍵交換とGSS-APIを用いた相互認証とを組合せた鍵交換法のクラスを定義する.

source: For example, the method name for ECDH key exchange with ephemeral keys generated on the sect409k1 curve is "ecdh-sha2-1.3.132.0.36".
ja: たとえば, sect409k1 曲線から生成された一時鍵を用いるECDHの方法の名前は "ecdh-sha2-1.3.132.0.36" だ.

source: Each supported (allowed) algorithm MUST be listed in order of preference, from most to least.
ja: それぞれのサポートする(許可する)アルゴリズムは, 優先度の降順にリストされなければならない.

source: There are a number of challenges to be addressed to map Secure Shell authentication method parameters into the SNMP architecture so that SNMP continues to work without any surprises.
ja: SNMP を以前と変らない形で利用し続けるために, セキュアシェル認証法のパラメータを SNMP アーキテクチャにマップするために取り組む課題がいくつかある.

source: The second case that should be considered is similar to the first case in that it also happens at the time of connection, but this case points out the need for the secure distribution of server public keys.
ja: 考慮すべきケースの2つ目は, 接続時に起こる1つ目の場合と似ている. この場合は, サーバ公開鍵の安全な配布の必要に目を向けさせる.

source: Future RFCs may define new method names specifying new hash algorithms for use with ECMQV.
ja: 将来のRFCが, ECMQVと共に用いる新しいハッシュアルゴリズムを指定する新しい認証法の名前が定義するかもしれない.

source: This is a block cipher with 16-byte blocks.
ja: これは, 16byteブロックのブロック暗号だ.

source: [SSH-X509] defines two methods, x509v3-ecdsa-sha2-nistp256 and x509v3-ecdsa-sha2-nistp384, that are to be used for server and user authentication.
ja: [SSH-X509] は 2つの方法 x509v3-ecdsa-sha2-nistp256 と x509v3-ecdsa-sha2-nistp384 を定義している. これらはサーバとユーザの認証に利用できる.

source: The client will then invoke an SSH authentication service to authenticate the principal, such as that described in the SSH authentication protocol [RFC4252].
ja: クライアントは, SSH認証プロトコル [RFC4252] に記述されているように, プリンシパルを認証するためSSH認証サービスを起動する.

source: Each subtree is organized as a set of related objects.
ja: それぞれの部分木は, 関連するオブジェクトの集合で構成される.

source: Additionally, the implementation SHOULD limit the number of failed authentication attempts a client may perform in a single session (the RECOMMENDED limit is 20 attempts).
ja: 加えて, 実装はクライアントが1つのセッションで実行できる認証の失敗の数を制限する必要がある. (20回の試行を推奨の制限とする)

source: Clients MUST also accept empty responses from the user and pass them on as empty strings.
ja: クライアントは, ユーザからの空の応答を受け付け空の文字列として扱わなければならない.

source: Error Status
ja: エラー状態

source: o in the SSH_MSG_KEXDH_REPLY message [RFC4253]
ja: o SSH_MSG_KEXDH_REPLY メッセージ内 [RFC4253]

source: 12 VREPRINT Reprints the current input line.
ja: 12 VREPRINT 現在の入力行を再表示する.

source: o The minimum size of the data field of an Ethernet packet is 46 bytes [RFC0894].
ja: o イーサネットのパケットのデータフィールドの最小サイズは, 46 byte だ [RFC0894].

source: This range will be left for PRIVATE USE.
ja: この範囲は, プライベートな利用(PRIVATE USE)のために残されている.

source: Compression Algorithm Names .......................17 5.
ja: 圧縮アルゴリズム名 .......................17 5.

source: This method prescribes a fixed group on which all operations are performed.
ja: この方法は, すべての操作を固定された群の上で実行するよう規定しています.

source: The security of the Diffie-Hellman key exchange is based on the difficulty of solving the Discrete Logarithm Problem (DLP).
ja: Diffie-Hellman 鍵交換のセキュリティは, 離散対数問題 (DLP) が容易に解けないことに基づいている.

source: (Here, again, client means the side originating the session, and server means the other side.)
ja: (ここで, 繰り返すが, クライアントはセッションを始める側で, サーバは相手側だ.)

source: This memo describes a Transport Model that will make use of the existing and commonly deployed Secure Shell security infrastructure.
ja: このメモは, 既存で広く配置されているセキュアシェルセキュリティ基盤を用いるトランスポートモデルを記述する.

source: However, local policy MAY disable the mechanism or MAY
ja: しかし, ローカルなポリシーがこのメカニズムを無効にしてもよいし, マッチングが成功したとみなす前に追加の制約を課してもよい.

source: Message Numbers ................................................11 8.
ja: メッセージ番号 ................................................11 8.

source: Applicability Statement
ja: 適用性についての意見

source: o Introduced the new chunked framing mechanism to solve known security issues with the EOM framing.
ja: o EOM フレーミングの既知のセキュリティ問題を解決するため, 新しいチャンクされたフレーミングメカニズムを導入した.

source: In order to make the entire body of Security Considerations more accessible, Security Considerations for the transport, authentication, and connection documents have been gathered here.
ja: セキュリティに関する考察のすべての部分によりアクセスしやすくするため, トランスポート, 認証, コネクションの文書のセキュリティの考察をここに集約した

source: The SSHFP RDATA Format .....................................4 3.1.1.
ja: SSHFP RDATE フォーマット .....................................4 3.1.1.

source: This is the same encoding as is used by "ssh-rsa" signatures in [RFC4253].
ja: [RFC4253] の "ssh-rsa" 署名で用いられているのと同じエンコーディングだ.

source: As the previous example illustrates, a special character sequence, ]]>]]>, MUST be sent by both the client and the server after each XML document in the NETCONF exchange.
ja: 前出の例が示すように, 特殊な文字列, ]]>]]> を NETCONF 交換でのそれぞれの XML文書の後で クライアントもサーバも送らなければならない.

source: It is an implementation decision how such data is passed.
ja: どのようなデータを渡すかは実装の判断だ.

source: Van Oorshot and Wiener note that using short private exponents with a random prime modulus p makes the computation of the discrete logarithm easy [VAN-OORSCHOT].
ja: Van Oorshot と Wiener note は ランダムな素数法(modulus) p で小さいプライベート指数を使うと 離散対数の計算を簡単にできることを示した [VAN-OORSCHOT].

source: Summary of Message Numbers
ja: メッセージ番号のまとめ

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in [RFC-2119].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, [RFC-2119] で記述されているように解釈される.

source: A signal can be delivered to the remote process/service using the following message.
ja: 次のメッセージを用いてリモートのプロセス/サービスにシグナルが伝達される.

source: A line is continued if the last character in the line is a '\'.
ja: 行の最後の文字が '\' なら行は継続される.
